---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBottomPrim
source: html/6933c4c1-6a16-f977-e6c7-f6b896efbdd5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBottomPrim Property

"Bottom (Primary Bar)"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanlengthBottomPrim { get; }
```